<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<!--Converted with LaTeX2HTML 2002-2-1 (1.71)
original version by:  Nikos Drakos, CBLU, University of Leeds
* revised and updated by:  Marcus Hennecke, Ross Moore, Herb Swan
* with significant contributions from:
  Jens Lippmann, Marek Rouchal, Martin Wilck and others -->
<HTML>
<HEAD>
<TITLE>Introducción</TITLE>
<META NAME="description" CONTENT="Introducción">
<META NAME="keywords" CONTENT="ManualElementosSEXTANTE">
<META NAME="resource-type" CONTENT="document">
<META NAME="distribution" CONTENT="global">

<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<META NAME="Generator" CONTENT="LaTeX2HTML v2002-2-1">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">

<LINK REL="STYLESHEET" HREF="ManualElementosSEXTANTE.css">

</HEAD>

<BODY >
<!--Table of Child-Links-->
<A NAME="CHILD_LINKS"><STRONG>Subsecciones</STRONG></A>

<UL CLASS="ChildLinks">
<LI><A NAME="tex2html126"
  HREF="node3.html#SECTION00310000000000000000">Introducción</A>
<LI><A NAME="tex2html127"
  HREF="node3.html#SECTION00320000000000000000">Elementos básicos de SEXTANTE</A>
</UL>
<!--End of Table of Child-Links-->
<HR>

<H1><A NAME="SECTION00300000000000000000">
Introducci&#243;n</A>
</H1>

<P>

<H1><A NAME="SECTION00310000000000000000">
Introducci&#243;n</A>
</H1>

<P>
Bienvenido a este tutorial de SEXTANTE. SEXTANTE es un conjunto de algoritmos de an&#225;lisis geogr&#225;fico de c&#243;digo libre desarrollado para la Junta de Extremadura para satisfacer sus propias necesidades de an&#225;lisis de la informaci&#243;n espacial. Este proyecto sigue la l&#237;nea de trabajo de la Junta de Extremadura en el desarrollo de programas libres, que comenz&#243; con el exitoso proyecto LinEx.

<P>
La librer&#237;a de SEXTANTE esta integrada en algunos de los m&#225;s populares SIG Java de escritorio. Si t&#250; tienes una aplicaci&#243;n SIG y quieres incorporar SEXTANTE como plataforma de an&#225;lisis espacial este tutorial es para t&#237;. 

<P>
La informaci&#243;n con la descripci&#243;n de los algoritmos de SEXTANTE no se encuentran en este libro. Para encontrar esta informaci&#243;n se debe descargar la ayuda contextual. 

<P>
SEXTANTE es software libre y se distribuye bajo licencia GPL. Si encuentras algo en &#233;l y en este manual que creas mejorable, no dudes en hacerlo saber. Vuestra ayuda es un elemento fundamental para conseguir un manual cada vez m&#225;s &#250;til y preciso. 

<P>

<H1><A NAME="SECTION00320000000000000000">
Elementos b&#225;sicos de SEXTANTE</A>
</H1>

<P>
Existen cuatro elementos b&#225;sicos en la interfaz gr&#225;fica de SEXTANTE, los cuales permiten el acceso a todas las herramientas de formas diversas, en funci&#243;n de las necesidades de cada usuario y cada proyecto de trabajo. 

<P>
Dependiendo de la aplicaci&#243;n SIG que se est&#233; usando, estos elementos pueden estar disponibles a trav&#233;s del men&#250; (generalmente debajo del men&#250; llamado SEXTANTE) o la barra de herramientas como se muestra a continuaci&#243;n.

<P>
<DIV ALIGN="CENTER">
<IMG
  WIDTH="525" HEIGHT="139" ALIGN="BOTTOM" BORDER="0"
 SRC="./sextante_elementos.png"
 ALT="Image sextante_elementos">

</DIV>

<P>

<UL>
<LI>Gestor de extensiones de SEXTANTE. Es el elemento principal de la interfaz gr&#225;fica de la librer&#237;a. Permite ejecutar una extensi&#243;n o correr una proceso por lotes basado en un algoritmo. Esta ser&#225; la forma mas habitual en que utilices SEXTANTE.
		<DIV ALIGN="CENTER">
<IMG
  WIDTH="402" HEIGHT="501" ALIGN="BOTTOM" BORDER="0"
 SRC="./gestorExtensiones1.png"
 ALT="Image gestorExtensiones1">
		
</DIV>

<P>
</LI>
<LI>Modelizador gr&#225;fico de SEXTANTE. El modelizador te permitir&#225; combinar varios algoritmos gr&#225;ficamente, creando un proceso mayor que engloba varios subprocesos (algoritmos). 
		<DIV ALIGN="CENTER">
<IMG
  WIDTH="718" HEIGHT="503" ALIGN="BOTTOM" BORDER="0"
 SRC="./modelizador.png"
 ALT="Image modelizador">
		
</DIV>

<P>
</LI>
<LI>L&#237;nea de comandos de SEXTANTE. La consola de SEXTANTE permitir&#225; a los usuarios m&#225;s avanzados hacer un uso mas &#225;gil del programa y automatizar tareas mediante la creaci&#243;n de sencillos <SPAN  CLASS="textit">scripts</SPAN>.
		<DIV ALIGN="CENTER">

		
</DIV>

<P>
</LI>
<LI>Historial de SEXTANTE. Todas las acciones llevadas a cabo con SEXTANTE se registran en un historial. &#201;ste puede posteriormente consultarse, as&#237; como ejecutar desde &#233;l sistem&#225;ticamente dichas acciones, facilitando la repetici&#243;n de procesos.
			<DIV ALIGN="CENTER">
<IMG
  WIDTH="493" HEIGHT="380" ALIGN="BOTTOM" BORDER="0"
 SRC="./historial.png"
 ALT="Image historial">
			
</DIV>
</LI>
</UL>

<P>
Veremos todas estas herramientas en los siguientes cap&#237;tulos.

<P>
<BR><HR>
<ADDRESS>
Victor Olaya
2010-02-18
</ADDRESS>
</BODY>
</HTML>
